/*****************************************************************************************************
 * 文件：task.c
 * 介绍：与 task 相关外部函数接口的实现
 * 作者：lxx
 * 日期：2022/01/02
*****************************************************************************************************/
/*****************************************************************************************************
 *                                              头文件包含
*****************************************************************************************************/
#include "task.h"

/*****************************************************************************************************
 *                                              函数实现
*****************************************************************************************************/
/*****************************************************************************************************
 * 函数：ListMonoHeadInsert
 * 介绍：将单向链表节点从单向链表资源的头部插入
 * 输入：pListResc		 单向链表资源指针
 * 		pListNode		单向链表节点指针
 * 输出：TASK_ERR_NONE	 任务创建完成
 * 		TASK_ERR_ARGS	传入参数异常，创建失败
*****************************************************************************************************/
task_return_t TaskCreatWithStack (ptask_fun_t   pTaskFun,
                                    pos_tcb_t   pTcb,
                                    cpu_add_t   StackAddr,
                                    uint32_t    StackSize)
{
    /*
        对于传入的各种参数进行判断
    */
    if ((!pTaskFun)     \
        || (!pTcb)) {
        os_err("%s %d input args error! \r\n", __FUNCTION__, __LINE__);
        return(TASK_ERR_NONE);
    }
    /*
        1、stack 对齐的原因：为了保证 cpu 可以快速的访问，如果未对齐，则比理论访问的次数多至少1次
        2、对于 stack 做8字节的向上对齐，此时需要确认 size 和对齐之后是否还存在
    */
    StackAddr + StackSize > (StackAddr + StackSize) + ~((cpu_add_t)0x07);
    
}

#define ALGIN_BYTE          (8)
#define UP_ALGIN(type, addr, nbyte)   \
                (addr + nbyte - 1) & (~((type)nbyte - 1))
